{
  "current_version": "3.22.0",
  "download_url": "https://github.com/wafixhub/wafix-V1.2.0/releases/download/V1.2.0/wafixhub_pack.zip",
  "release_key": "2026-02-27_1404",
  "notes": "V3.22.0 — 27.02.2026\n────────────────────────\n• This release includes important bug fixes to address issues introduced after recent platform changes\n\nV3.20.26 — 27.02.2026\n────────────────────────\n• Fixed an issue affecting message retrieval (getMessages) due to internal structural changes.\n• Resolved an invalid ID (WID) value error when handling certain objects or opening chats.\n• Fixed a sending issue when delivering messages to specific LID-based identifiers, improving overall message stability.\n(Note: This update is intended for the official versions WaSender 3.7.0 and WaCRM 3.3.0. Users running modified or unofficial versions may experience issues.)\n\nV3.20.25 — 26.02.2026\n────────────────────────\n• WaSender 3.7.0 & WaCRM 3.3.0 (Official Versions): Fixed an issue affecting some users where group member extraction was not working properly or returning incomplete results in certain cases.\n• Fixed a messaging issue where some recipients were being skipped when sending standard messages, Quick Replies, or Auto Reply messages, ensuring that all selected contacts now receive messages without exception.\n• Improved the number extraction mechanism from groups, chats, and Labels, resolving cases where incorrect or unusual IDs were returned. The system now accurately retrieves real phone numbers.\n• Enhanced overall sending stability and ensured accurate targeting of the correct phone number for each message, with improved reliability during campaigns and bulk sending.\n• (Note: This update is intended for the official versions WaSender 3.7.0 and WaCRM 3.3.0. Users running modified or unofficial versions may experience issues.)\n\nV3.20.24 — 20.02.2026\n────────────────────────\n• WaSender & WaCRM: Fixed an issue where media attachments (Images, Videos, and Audio) were failing to send in standard messages, Quick Replies, and Auto Reply mode.\n\nV3.20.23 — 15.02.2026\n────────────────────────\n• Official WaSender 3.7.0 Update: Fixed and restored the Social Media Data Extraction feature from search engines and social platforms, resolving the previous failure and ensuring complete data retrieval.\n\nV3.20.22 — 14.02.2026\n────────────────────────\n• Official WaSender 3.7.0 Update: Fixed the ChromeDriver auto-update issue to ensure the correct official version is downloaded properly.\n• Fixed Google Maps data extraction when using the Old Classic UI (legacy browser mode), resolving rating and data duplication issues.\n(Users running unofficial or modified versions may experience issues; this update is intended only for the official latest version 3.7.0.)\n\nV3.20.21 — 14.02.2026\n────────────────────────\n• WaSender: Fixed an issue affecting some users where group member number extraction was inconsistent or partially failing, and also resolved a related issue with extracting active group members.\n\nV3.20.2 — 26.01.2026\n────────────────────────\n• WaSender: Fixed an issue with extracting data from Google Maps.\n• GMExtractor: Added update support for future releases and fixed data extraction issues from Google Maps.\n• Fixed an issue where messages sent by Auto Reply were not marked as read in WaCRM and WaSender.\n\nV3.19.72 — 16.01.2026\n────────────────────────\n• Fixed an issue where List Messages were not sent correctly in Auto Reply mode.\n\nV3.19.71 — 15.01.2026\n────────────────────────\n• Fixed an issue where messages sent to new contacts were delivered but the chat did not appear or open correctly.\n\nV3.19.46 — 02.01.2026\n────────────────────────\n• Fixed an issue where the program could freeze during scanning when reaching the contact verification stage inside WaDefender.\n\nV3.19.45 — 21.12.2025\n────────────────────────\n• Comprehensive fix for Welcome Messages and Quick Replies to ensure media and messages are delivered successfully to new numbers and Ad leads.\n• Fixed messaging issues when contacting users selected via Labels.\n• New organized UI: Added a smart folding feature for Quick Reply buttons to save screen space, with an option to pin frequently used replies."

}
